experiments/basic/workload/job/test-script.yaml
# In Artillery, each VU will be assigned to one of the defined
# scenarios. By default, each scenario has a weight of 1, meaning
# each scenario has the same probability of getting assigned to a
# VU.
#
# By specifying a weight in a scenario, you'll increase the chances
# of Artillery assigning the scenario for a VU. The probability of
# a scenario getting chosen depends on the total weight for all
# scenarios.
#
# To learn more, read the Artillery documentation on scenario weights:
# https://artillery.io/docs/guides/guides/test-script-reference.html#Scenario-weights

config:
  target: "http://entry.apps:80"
  plugins:
    publish-metrics:
      - type: prometheus
        pushgateway: "http://prometheus-pushgateway.monitoring:9091"
        prefix: 'artillery_k8s'
        tags:
          - "load_test_id:{{ my_test_job_name }}"
          - "type:loadtest"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load
scenarios:
  - name: "procedure"
    flow:
      - post:
          url: "/v0/demo"
          headers:
            maxcalls: '2'
            calls: '1'
            fanout: '1'
          json:
            p1_v0: "aaaaaaaaa"
            p2_v0: "aaaaaaaaa"
            p3_v0: "aaaaaaaaa"
            p4_v0: "aaaaaaaaaa"
            p5_v0: "aaaaaaaaaa"